# ReynoldsNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..ReynoldsNumber Property
DuctPressureDropData Class See Also
---
The reynolds number of the duct.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double ReynoldsNumber { get; set; }
```

Visual Basic
---
```text
Public Property ReynoldsNumber As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ReynoldsNumber {
	double get ();
	void set (double value);
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace